In [66]:
import pandas as pd
import csv

# V. Clean data

In [67]:
df = pd.read_csv("extract_cost_of_living.csv")
# print(df)

In [68]:
# ~ devant une condition pour l'inverse
df[~df['Price'].str.contains(r'\$')]

,Country,Item,Price
54,Afghanistan,"Mortgage Interest Rate in Percentages (%), Yea...",17.31
109,Aland Islands,"Mortgage Interest Rate in Percentages (%), Yea...",3.90
164,Albania,"Mortgage Interest Rate in Percentages (%), Yea...",5.63
175,Alderney,"Rice (white), (1kg)",?
176,Alderney,Eggs (regular) (12),?
...,...,...,...
12686,Western Sahara,Mobile Phone Monthly Plan with Calls and 10GB+...,?
12704,Western Sahara,"Mortgage Interest Rate in Percentages (%), Yea...",?
12759,Yemen,"Mortgage Interest Rate in Percentages (%), Yea...",12.67
12814,Zambia,"Mortgage Interest Rate in Percentages (%), Yea...",21.25
12869,Zimbabwe,"Mortgage Interest Rate in Percentages (%), Yea...",14.21

In [69]:
# store others values that are not prices
otherThenPrice = df[~(df['Price'].str.contains(r'\$')) & ~(df['Price'].str.contains(r'\?'))]
otherThenPrice.to_csv("otherThenPrice_cost_of_living.csv", index=False, quoting=csv.QUOTE_NONNUMERIC)

In [70]:
df = df[df['Price'].str.contains(r'\$')]

In [71]:
df

,Country,Item,Price
0,Afghanistan,"Meal, Inexpensive Restaurant",2.05 $
1,Afghanistan,"Meal for 2 People, Mid-range Restaurant, Three...",10.13 $
2,Afghanistan,McMeal at McDonalds (or Equivalent Combo Meal),3.42 $
3,Afghanistan,Domestic Non-Alcoholic Beer (0.5 liter draught),2.74 $
4,Afghanistan,Imported Non-Alcoholic Beer (0.33 liter bottle),6.84 $
...,...,...,...
12864,Zimbabwe,Apartment (3 bedrooms) in City Centre,722.73 $
12865,Zimbabwe,Apartment (3 bedrooms) Outside of Centre,511.74 $
12866,Zimbabwe,Price per Square Meter to Buy Apartment in Cit...,"1,050.00 $"
12867,Zimbabwe,Price per Square Meter to Buy Apartment Outsid...,"1,424.13 $"
12868,Zimbabwe,Average Monthly Net Salary (After Tax),367.91 $

In [72]:
df["Price"] = df["Price"].str.replace(",", "")
df["Price"] = df["Price"].str.extract(r'(\d+\.?\d*)')

In [73]:
df

           Country                                               Item    Price
0      Afghanistan                      Meal, Inexpensive Restaurant      2.05
1      Afghanistan  Meal for 2 People, Mid-range Restaurant, Three...    10.13
2      Afghanistan    McMeal at McDonalds (or Equivalent Combo Meal)      3.42
3      Afghanistan   Domestic Non-Alcoholic Beer (0.5 liter draught)      2.74
4      Afghanistan   Imported Non-Alcoholic Beer (0.33 liter bottle)      6.84
...            ...                                                ...      ...
12864     Zimbabwe             Apartment (3 bedrooms) in City Centre    722.73
12865     Zimbabwe          Apartment (3 bedrooms) Outside of Centre    511.74
12866     Zimbabwe  Price per Square Meter to Buy Apartment in Cit...  1050.00
12867     Zimbabwe  Price per Square Meter to Buy Apartment Outsid...  1424.13
12868     Zimbabwe            Average Monthly Net Salary (After Tax)    367.91

[12058 rows x 3 columns]

# VI Save clean data

In [74]:
# data to csv
df.to_csv("clean_cost_of_living.csv", index=False, quoting=csv.QUOTE_NONNUMERIC)

In [75]:
a = pd.read_csv("clean_cost_of_living.csv")

In [76]:
a.dtypes

Country     object
Item        object
Price      float64
dtype: object